app/Controllers/Admin_controller.php

SELECT *
FROM `contacto`
---
    public function ver_consultas(){
        $contactoModel = new ContactoModel();

        $mensajes = $contactoModel->findAll(); //Obtener todas las consultas desde la base de datos