app/Controllers/Producto_controller.php

    public function catalogo($orden=null){
        $productos = new ProductoModel();
        //$productos = $productoModel->join('categoria', 'categoria.id_categoria=producto.categoria_producto')->where('estado_producto',1);
        if ($orden == 'precio_asc') {
            $productos->orderBy('(CASE WHEN cantidad_producto = 0 THEN 1 ELSE 0 END)', 'ASC');
            $productos->orderBy('precio_producto', 'ASC');
        } elseif ($orden == 'precio_desc') {
            $productos->orderBy('(CASE WHEN cantidad_producto = 0 THEN 1 ELSE 0 END)', 'ASC');
            $productos->orderBy('precio_producto', 'DESC');
        }else{
            $productos->orderBy('(CASE WHEN cantidad_producto = 0 THEN 1 ELSE 0 END)', 'ASC');
        }

        $data['titulo'] = 'Catalogo';
        $data['h1'] = 'Productos';
        $data['productos'] = $productos->where('estado_producto',1)->findAll();
---
SELECT *
FROM `producto`
WHERE `estado_producto` = 1
ORDER BY (CASE WHEN cantidad_producto = 0 THEN 1 ELSE 0 END) ASC

    public function cargar_productos(){
        $data['titulo']='cargar productos';

        $categoria = new CategoriaModel();
        $proveedor = new ProveedorModel();

        $categorias = $categoria->findAll();
        $proveedores = $proveedor->findAll();
---
SELECT *
FROM `categoria`
SELECT *
FROM `proveedor`