app/Controllers/Usuario_controller.php

SELECT *
FROM `usuario`
WHERE `email_usuario` = 'cliente@gmail.com'
 LIMIT 1
---

            // Verificar credenciales en la base de datos
            $userModel = new UserModel();
            $user = $userModel->where('email_usuario', $email)->first();