app/Controllers/Venta_controller.php

SELECT *
FROM `venta`
JOIN `usuario` ON `usuario`.`id_usuario`=`venta`.`id_cliente`
---
    public function listar_ventas(){
        $venta = new VentaModel();
        $data['titulo']= "Listado de ventas";
        $data['ventas']=$venta->join('usuario','usuario.id_usuario=venta.id_cliente')->findAll();